Revit 2027 API
RebarConstraint.FlipHandleOverTarget Method
 Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void FlipHandleOverTarget()
Public Sub FlipHandleOverTarget
public:
void FlipHandleOverTarget()
member FlipHandleOverTarget : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a Shape Driven Rebar element. -or- The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Remarks
Throw exception if constraint type is not to a Shape Driven Rebar, or for constraints involving bar/hook bend handle.
Throws exception if the constraint is for a handle of a Free Form Rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace